{
	"frames": [
		{
			"id": 999,
			"text": "GAME OVER! RETRY? \n\nType 'load' to load previous save!\nType 'exit' to quit!",
			"answers": [
				{
					"reply":"Retry",
					"frame_id" : 0
				}
			]
		},
		{
			"id": 0,
			"text": "SYSTEM INITIALIZED. BETA VERSION 0.6\nWELCOME!\n\nType 'save' to save your progress!\nType 'exit' to quit!",
			"answers": [
				{
					"reply":"Folytatas",
					"frame_id" : 1
				}
			]
		},
		{
			"id": 1,
			"text": "CHAPTER 1: INTRO.EXE \nLassan kinyitod a szemed. 7:51-et mutat az ora. Ataludtad az ebresztodet es 10 percen belul be kell erned a munkahelyre. Panikolva kikelsz az agyadbol es magadra huzod a ruhaidat. \nElotted a haloszobad ket ajtaja, egyik a konyhaba vezet, masik a furdoszobaba. Mit teszel?",
			"answers": [
				{
					"reply":"Furdoszoba",
					"frame_id" : 2
				},
				{
					"reply" : "Konyha",
					"frame_id" : 3
					
				},
				{
					"reply" : "",
					"frame_id" : 4
					
				}
			]
		},
		{
			"id": 2,
			"text": "Sietve berohansz a furdobe. Egy kezzel a fogkefehez nyulsz, masikkal meg az ingedet igazitod. Nagy kapkodasodkozepette valahogy sikerul feloltoznod es megmosnod a fogad, de a reggelire mar ugy nez ki, nem lesz ido. Felkapod a taskadat, majd kirohansz az ajton. \nToled balra a kocsibejarodban all a autod, mogotte a garazsban a falnak tamasztva a biciklid. 5 perced van beerni munkaba. Mit teszel?",
			"answers": [
				{
					"reply" : "Auto",
					"frame_id" : 5
				},
				{
					"reply" : "Bicikli",
					"frame_id" : 6
				}
			]
		},
		{
			"id": 3,
			"text": "Kifutsz a konyhaba, egy gyors mozdulattal kirantod ahutoajtot majd kiveszel belole egy bontott csomag parizert, szeletelt sajtot es vajat. Rekordsebesseggel kened meg az utolso ket megmaradt szelet kenyeret, osszedobsz egy gyors szendvicset, es meg ugyanazzal a lendulettel a felet a szadba tomod. Az orad mar 7:55-ot mutat, ugy latszik kenytelen leszel kihagyni a mosakodast. Felkapod a taskadat, majd kirohansz az ajton. \nToled balra a kocsibejarodban all a autod, mogotte a garazsban a falnak tamasztva a biciklid. 5 perced van beerni munkaba. \nMit teszel?",
			"answers": [
				{
					"reply" : "Auto!",
					"frame_id" : 5
				},
				{
					"reply" : "Bicikli",
					"frame_id" : 6
				}
			]
		},
		{
			"id": 4,
			"text": "Veszel egy nagy levegot, megallsz egy pillanatra es elgondolkodsz magadban: 'miert is kene kapkodnom? Minek panikoljak? Mar ugyis mindegy, nem erdekel az egesz!' Elegedett fejjel sohajtasz egyet, kihuzod a vekkert a konnektorbol, majd nyugodt lelekkel visszamaszol az agyba. \nENDING: LESZ@ROM",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		},
		{
			"id": 5,
			"text": "Meg szerencse hogy a slusszkulcsod pont a nadragzsebedben maradt. Kinyitod a kocsid, beszallsz, eltekered az inditokulcsot; megkonnyebbules tolt el, hogy elsore elindul, mar csak egy lemerult akksi vagy egy ures tank hianyzott volna. Csikorgo gumikkal hajtasz le az utra. Utkozben viszont bekovetkezik az, amitol legbelul a legjobban tartottal: dugoba kerulsz. \nAhogy az ora 8:00-t ut, a panikhangulatod szomoru beletorodesbe torkollik at. Vegul nagynehezen megindul a forgalom, es lassan de biztosan elered az uticelod.",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 7
				}
			]
		},
		{
			"id": 6,
			"text": "Valami azt sugallja szamodra, hogy autoval munkaba sietni a reggeli csucsforgalom kozepette nem a legjobb otlet, viszont kerdeses, hogy vajon kepes vagy e idore beerni biciklivel. Eleg magabiztosnak erzed magad, ezert gyorsan biciklire pattansz, majd nekiallsz tekerni amilyen intenziven csak a labaid birjak. Nagyjabol 5 percnyi Tour de France versenyzoket megszegyenito tekeres utan rapillantasz a karoradra, es tudvan hogy meg feluton sem vagy, elszall beloled a remeny, es csalodottan, lassabb tempoban tekersz tovabb. \nUtkozben azonban rapillantasz az uton sorakozo autok szazaira, es enyhe karorvendo altonussal ketelkedsz magadban afelol, hogy valoban jobban jartal volna-e, ha megis a kocsidat valasztod. Lassan de biztosan elered az uticelod.",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 8
				}
			]
		},
		{
			"id": 7,
			"text": "CHAPTER 2: SETUP.EXE \nSietve futsz be a nagy AllSafe Cybersecurity Inc. felirat alatt a fotocellas ajton, es gyermeki orommel latod hogy a a felvono pont nyitva all elotted, uresen. Gyorsan be is ugrasz, es nagy lendulettel nyomod meg a harmadik emelet gombjat.\nA liftbol kilepve egy tucat szempar tekintetenek sulyat erzed a vallaidon, de magadat nyugtatod azzal, hogy vegulis nem kestel olyan sokat, lehetett volna rosszabb is. A fonokod, Gideon is eszrevesz teged, es egy nem eppen derutol virulo arccal koszont",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 9
				}
			]
		},
		{
			"id": 8,
			"text": "CHAPTER 2: SETUP.EXE \nSietve futsz be a nagy AllSafe Cybersecurity Inc. felirat alatt a fotocellas ajton, es gyermeki orommel latod hogy a a felvono pont nyitva all elotted, uresen. Gyorsan be is ugrasz, es nagy lendulettel nyomod meg a harmadik emelet gombjat.\nA liftbol kilepve egy tucat szempar tekintetenek sulyat erzed a vallaidon, de magadat nyugtatod azzal, hogy vegulis nem kestel olyan sokat, lehetett volna rosszabb is. A fonokod, Gideon is eszrevesz teged, es egy nem eppen derutol virulo arccal koszont",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 10
				}
			]
		},
		{
			"id": 9,
			"text": "'Joreggelt, latom sikerult kimaszni az agybol. Tobbet ilyen ne forduljon elo legyszives! Na, nyomas, sok dolgunk van'\nValami azt sugallja, nincs minden rendben.",
			"answers": [
				{
					"reply" : "Valami baj van?",
					"frame_id" : 12
				},
				{
					"reply" : "Na, mit kevertek a kavejaba fonok?",
					"frame_id" : 11
				}
			]
		},
		{
			"id": 10,
			"text": "'Joreggelt, csak sikerult megerkezni. Te maratont futottal, hogy igy le vagy izzadva? Mindegy, hutsd le magad, es tobbet ilyen ne forduljon elo legyszives! Na, nyomas, sok dolgunk van'\nA passziv-agressziv hanglejtese azt sugallja, nincs minden rendben.'",
			"answers": [
				{
					"reply" : "*flegma hangnemben* Koszi szepen!",
					"frame_id" : 11
				},
				{
					"reply" : "Bocs hogy kestem! Minden oke?",
					"frame_id" : 12
				}
			]
		},
		{
			"id": 11,
			"text": "'Ezt inkabb meg sem hallottam. Munkara!'",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 13
				}
			]
		},
		{
			"id": 12,
			"text": "'Azon kivul hogy lemaradtal a reggeli stand up meetingrol? Amiben ertesitettunk mindenkit a tegnap keso esti breach-rol?'",
			"answers": [
				{
					"reply" : "Ez komoly? Basszus!",
					"frame_id" : 13
				}
			]
		},
		{
			"id": 13,
			"text": "Odakocogsz az asztalodhoz, ledobod a taskadat es bekapcsolod a gepedet. A szomszed asztaltol Lloyd odakoszon.\n'Hali! Miujsag, elaludtal?'",
			"answers": [
				{
					"reply" : "Ja, sajnos. Te figyelj, mi ez a nagy felhajtas, mi folyik itt?",
					"frame_id" : 14
				},
				{
					"reply" : "Mi baja van a fonoknek? Mirol maradtam le?",
					"frame_id" : 14
				}
			]
		},
		{
			"id": 14,
			"text": "'Ja, nem nagy cucc. Network management-esek szerint tegnap keso este valaki vagy valakik bejutottak a halozatra.",
			"answers": [
				{
					"reply" : "Nem nagy cucc?! Egy breach azert elegge 'nagy cucc', mar ne is haragudj!",
					"frame_id" : 15
				},
				{
					"reply" : "*nevetve* Ahhoz kepest eleg nyugodtnak tunsz.",
					"frame_id" : 15
				}
			]
		},
		{
			"id": 15,
			"text": "'Azota sem talaltunk semmit. Latszolag semmi kar nem keletkezett, virusra utalo nyomokat sem talaltunk. Mintha tok veletlenul tortent volna ez az egesz.'",
			"answers": [
				{
					"reply" : "Azt lehet tudni, pontosan hova es hogyan jutottak be? Vagy hogy egyaltalan bent vannak meg??",
					"frame_id" : 16
				},
				{
					"reply" : "Vagy lehet hogy csak nagyon alaposan kitakaritottak maguk utan.",
					"frame_id" : 17
				}
			]
		},
		{
			"id": 16,
			"text": "'Fogalmam sincs. Ha annyira izgatnak a reszletek, kerdezd Elliotot, mar ha egyaltalan szoba all veled. En kimegyek egy kaveert.'\nLloyd felall, es mint aki jol vegezte dolgat, magabiztos leptekkel kisetal az irodabol. Lloyd sosem volt az az idegeskedos tipus, de valahogy mindig is olyan furcsa volt, hogy ennyire nem zavarja semmi sem. Visszaemlekszel a multkori ransomware tamadasra, ami eszkozok ezreit megfertozte, es tobb, nagyobb ceg is aldozataul esett. Lloyd mar akkor is ugy viselkedett, mint akit egyaltalan nem erint az egesz.\nSzerencsere a virus eleg rozoga modon lett osszerakva, igy a veszelyt viszonylag hamar sikerult megszuntetni. Valamiert viszont ugy erzed, hogy a mostani breachnek lehet valami koze hozza.\nMit teszel?",
			"answers": [
				{
					"reply" : "Nekiallok a munkanak",
					"frame_id" : 999
				},
				{
					"reply" : "Odamegyek Elliothoz",
					"frame_id" : 18
				}
			]
		},
		{
			"id": 17,
			"text": "'Lehet... Mindenesetre en kiugrok egy kaveert.'\nLloyd felall, es mint aki jol vegezte dolgat, magabiztos leptekkel kisetal az irodabol. Lloyd sosem volt az az idegeskedos tipus, de valahogy mindig is olyan furcsa volt, hogy ennyire nem zavarja semmi sem. Visszaemlekszel a multkori ransomware tamadasra, ami eszkozok ezreit megfertozte, es tobb, nagyobb ceg is aldozataul esett. Lloyd mar akkor is ugy viselkedett, mint akit egyaltalan nem erint az egesz.\nSzerencsere a virus eleg rozoga modon lett osszerakva, igy a veszelyt viszonylag hamar sikerult megszuntetni. Valamiert viszont ugy erzed, hogy a mostani breachnek lehet valami koze hozza.'",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		},
		{
			"id": 18,
			"text": "Felallsz az geped elol, es kicsit idegesen odasetalsz Elliot asztalahoz. \nKozismerten maganak valo, sztoikus, rendkivul visszahuzodo, olykor-olykor egyenesen bunko. Te valahogy megis tobbet latsz benne. Nem titok, hogy eszmeletlenul intelligens, abszolut profi a szakmajaban. Nem tudod eldonteni hogy rejteget valamit, vagy csak depresszios es sulyos gondjai vannak, esetleg mindketto.\n Annyi biztos, hogy vele mar szobaallni is nehez ugy. Hogy inditasz?'",
			"answers": [
				{
					"reply" : "Elliot, szia! Bocsi, zavarhatlak egy pillanatra?",
					"frame_id" : 19
				},
				{
					"reply" : "Csao, mi a palya? Hallod, hadd kerdezzek valamit!",
					"frame_id" : 19
				},
				{
					"reply" : "...",
					"frame_id" : 21
				}
			]
		},
		{
			"id": 19,
			"text": "'Nem'",
			"answers": [
				{
					"reply" : "Tudsz valamit errol a breach dologrol?",
					"frame_id" : 24
				},
				{
					"reply" : "Naa, ne legyel mar ilyen!",
					"frame_id" : 20
				}
			]
		},
		{
			"id": 20,
			"text": "'Hagyj dolgozni kérlek.'",
			"answers": [
				{
					"reply" : "Akkor cseszd meg!",
					"frame_id" : 26
				},
				{
					"reply" : "Tudsz valamit errol a breach dologrol?",
					"frame_id" : 24
				}
			]
		},
		{
			"id": 21,
			"text": "'...''",
			"answers": [
				{
					"reply" : "'...'",
					"frame_id" : 22
				}
			]
		},
		{
			"id": 22,
			"text": "'...'",
			"answers": [
				{
					"reply" : "'...'",
					"frame_id" : 23
				}
			]
		},
		{
			"id": 23,
			"text": "'...mi van?'",
			"answers": [
				{
					"reply" : "Tudsz valamit errol a breach dologrol?",
					"frame_id" : 24
				},
				{
					"reply" : "Jah, ooo ize, semmi...",
					"frame_id" : 25
				}
			]
		},
		{
			"id": 24,
			"text": "'Ugyanannyit tudok amennyit te. Legyszives, hagyj dolgozni.'",
			"answers": [
				{
					"reply" : "'...'",
					"frame_id" : 26
				}
			]
		},
		{
			"id": 25,
			"text": "Elliot ertetlenkedve nez rad, majd vissza a monitorjara, es folytatja a munkat.",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 26
				}
			]
		},
		{
			"id": 26,
			"text": "Ez nem jott ossze. Rendkivul kinosan, furan erezve magad, visszaballagsz az asztalodhoz.",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 27
				}
			]
		},
		{
			"id": 27,
			"text": "Bejelentkezel, megnyitod az e-mailjeid es a Teams klienst, hatha tobbet megtudsz, mirol maradtal le. Az Outlook e-mailjeid kozott azonban a Spam mappaban talalsz egy uzenetet neked cimezve, aminek a targya 'AllSafe Cybersecurity dolgozoi hirlevel', a kuldo pedig legnagyobb meglepetesedre nem mas, mint sajat magad.\nMit teszel?",
			"answers": [
				{
					"reply" : "Megnyitom",
					"frame_id" : 28
				},
				{
					"reply" : "Torlom",
					"frame_id" : 29
				}
			]
		},
		{
			"id": 28,
			"text": "Tag szemekkel bamulod a kepernyod, megis miert kuldenel sajat magadnak egy spam e-mailt? Kivancsisagbol megnyitod. Az uzenet tartalma szinte teljesen ugyanaz, mint azok a napi hirlevelek, amiket szinte biztos, hogy soha senki nem olvas el, ez viszont csak neked lett cimezve.\nTovabb bogaraszod a mail tartalmat, amikor eszreveszel egy csatolmanyt: 'README.nfo'\nZavarodottsag es enyhe felelemerzet kevereke forog benned. Mi lehet ez a csatolmany? Miert egy hirlevelnek alcazott uzenetben lett kuldve? Miert en vagyok a felado? Es legfokeppen, miert nekem lett kuldve? Rengeteg kerdes forog benned, meg az is megfordul a fejedben, hogy lehet, hogy ennek valami koze lehet a tegnap esti breach-hez \nMit teszel?",
			"answers": [
				{
					"reply" : "Letoltom a csatolmanyt",
					"frame_id" : 999
				},
				{
					"reply" : "Torlom",
					"frame_id" : 29
				}
			]
		},
		{
			"id": 29,
			"text": "sample",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		},
		{
			"id": 30,
			"text": "sample",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		},
		{
			"id": 31,
			"text": "sample",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		},
		{
			"id": 32,
			"text": "sample",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		},
		{
			"id": 33,
			"text": "sample",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		},
		{
			"id": 34,
			"text": "sample",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		},
		{
			"id": 35,
			"text": "sample",
			"answers": [
				{
					"reply" : "Folytatas",
					"frame_id" : 999
				}
			]
		}

	]
}